app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies"
---
  def bydirectors
    @movie = Movie.find(params[:id])
    @movies = Movie.all